{
  "backend/main.mo": "Motoko actor with a generateImage function that returns a placeholder image URL; contains a token constant for future API integration.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing summaries of frontend files including components, hooks, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with extensive CSS custom properties for light and dark themes using OKLCH color space with neutral grayscale palette.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with sticky header, ImageGenerator main content, and Footer in a flex column layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, attribution with heart icon, and caffeine.ai link with UTM tracking parameters.",
  "frontend/src/components/ImageGenerator.tsx": "Main UI component with textarea for prompt input, generate button with loading states, error handling, and conditional image display card.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with authentication support, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication with AuthClient integration, login/logout functionality, and status management.",
  "frontend/src/hooks/useQueries.ts": "React Query mutation hook that calls the backend actor's generateImage function with error handling.",
  "frontend/src/index.css": "Tailwind CSS with custom OKLCH color tokens defining warm earth tones (terracotta primary, cream secondary, vibrant green accent) for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point wrapping App with QueryClientProvider and InternetIdentityProvider for React Query and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, shadows, fonts (Inter), and accordion animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for an image generation application showing completed frontend features (prompt input UI with custom design theme avoiding blue/purple) and pending backend tasks (placeholder image generation endpoint, Replicate API token constant). Notes non-standard JavaScript backend for ICP."
}