{
  "backend/main.mo": "Motoko backend actor with a generateImage function that currently returns a placeholder image URL; includes an unused token variable and OutCall import.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing summaries of six frontend files describing the image generator UI, styling, and React Query integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes using neutral grayscale values.",
  "frontend/index.html": "Basic HTML entry point with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with sticky header containing logo and title, ImageGenerator component in main section, and Footer component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, attribution message with heart icon, and caffeine.ai link with UTM tracking parameters.",
  "frontend/src/components/ImageGenerator.tsx": "Image generation UI with textarea for prompt input, generate button with loading states, error handling, and card display for generated images using shadcn/ui components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using @dfinity/auth-client with login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "React Query mutation hook for calling the backend generateImage function with error handling.",
  "frontend/src/index.css": "Tailwind CSS with custom OKLCH color tokens defining warm earth tones (terracotta primary, cream secondary, vibrant green accent) for light and dark modes.",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom border radii, shadows, fonts (Inter), and animations for accordion components, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting an image generation app using Hugging Face Stable Diffusion API via Motoko backend, with a pending feature request to replace backend/main.mo with HTTP outcall implementation that returns base64-encoded images."
}